app/Http/Middleware/AfterTime.php

select * from `test_middleware` where `TM_ID` = 3 limit 1
select * from `test_middleware`
---
    public function handle(Request $request, Closure $next)
    {
        // cache()->forget('bye');
       //saveing cache
        $beforeTime = cache()->remember('bye','',function(){
            return TestMiddleware::get();
       });